Revit 2027 API
Viewport.ViewAnchor Property
 Specifies the method by which the view will be positioned on the sheet and for the case when it is swapped to another view. Default is set to ViewAnchor.ViewOrigin.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewAnchor ViewAnchor { get; }
Public ReadOnly Property ViewAnchor As ViewAnchor
	Get
public:
property ViewAnchor ViewAnchor {
	ViewAnchor get ();
}
member ViewAnchor : ViewAnchor with get
Property Value
ViewAnchor
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace